wrk_rps_merged/219
Running 5m test @ http://10.105.118.50:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 230.352ms, rate sampling interval: 1396ms
  Thread calibration: mean lat.: 231.906ms, rate sampling interval: 1422ms
  Thread calibration: mean lat.: 213.043ms, rate sampling interval: 1390ms
  Thread calibration: mean lat.: 228.002ms, rate sampling interval: 1439ms
  Thread calibration: mean lat.: 224.263ms, rate sampling interval: 1427ms
  Thread calibration: mean lat.: 246.983ms, rate sampling interval: 1488ms
  Thread calibration: mean lat.: 223.841ms, rate sampling interval: 1271ms
  Thread calibration: mean lat.: 234.240ms, rate sampling interval: 1418ms
  Thread calibration: mean lat.: 228.522ms, rate sampling interval: 1304ms
  Thread calibration: mean lat.: 238.402ms, rate sampling interval: 1400ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   358.16ms  316.51ms   2.51s    74.88%
    Req/Sec     9.53      2.25    18.00     83.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  304.13ms
 75.000%  504.83ms
 90.000%  708.61ms
 99.000%    1.62s 
 99.900%    1.91s 
 99.990%    1.95s 
 99.999%    2.52s 
100.000%    2.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.515     0.000000            1         1.00
      33.535     0.100000         2905         1.11
     126.079     0.200000         5800         1.25
     149.631     0.300000         8704         1.43
     227.455     0.400000        11601         1.67
     304.127     0.500000        14518         2.00
     320.511     0.550000        15957         2.22
     341.759     0.600000        17405         2.50
     408.063     0.650000        18861         2.86
     428.799     0.700000        20309         3.33
     504.831     0.750000        21749         4.00
     515.839     0.775000        22476         4.44
     546.303     0.800000        23201         5.00
     602.111     0.825000        23932         5.71
     614.399     0.850000        24655         6.67
     687.103     0.875000        25374         8.00
     700.415     0.887500        25752         8.89
     708.607     0.900000        26103        10.00
     723.455     0.912500        26463        11.43
     796.159     0.925000        26829        13.33
     811.007     0.937500        27187        16.00
     828.415     0.943750        27367        17.78
     899.071     0.950000        27557        20.00
     917.503     0.956250        27733        22.86
    1020.927     0.962500        27911        26.67
    1204.223     0.968750        28092        32.00
    1258.495     0.971875        28184        35.56
    1338.367     0.975000        28276        40.00
    1419.263     0.978125        28364        45.71
    1495.039     0.981250        28455        53.33
    1519.615     0.984375        28546        64.00
    1533.951     0.985938        28594        71.11
    1554.431     0.987500        28637        80.00
    1610.751     0.989062        28682        91.43
    1625.087     0.990625        28728       106.67
    1690.623     0.992188        28772       128.00
    1700.863     0.992969        28795       142.22
    1711.103     0.993750        28823       160.00
    1723.391     0.994531        28840       182.86
    1763.327     0.995313        28863       213.33
    1800.191     0.996094        28885       256.00
    1805.311     0.996484        28900       284.44
    1808.383     0.996875        28911       320.00
    1813.503     0.997266        28921       365.71
    1831.935     0.997656        28931       426.67
    1852.415     0.998047        28942       512.00
    1893.375     0.998242        28948       568.89
    1895.423     0.998437        28953       640.00
    1902.591     0.998633        28960       731.43
    1908.735     0.998828        28965       853.33
    1913.855     0.999023        28971      1024.00
    1914.879     0.999121        28974      1137.78
    1917.951     0.999219        28977      1280.00
    1926.143     0.999316        28980      1462.86
    1928.191     0.999414        28983      1706.67
    1930.239     0.999512        28984      2048.00
    1931.263     0.999561        28987      2275.56
    1931.263     0.999609        28987      2560.00
    1936.383     0.999658        28989      2925.71
    1937.407     0.999707        28990      3413.33
    1938.431     0.999756        28993      4096.00
    1938.431     0.999780        28993      4551.11
    1938.431     0.999805        28993      5120.00
    1940.479     0.999829        28994      5851.43
    1940.479     0.999854        28994      6826.67
    1953.791     0.999878        28996      8192.00
    1953.791     0.999890        28996      9102.22
    1953.791     0.999902        28996     10240.00
    1953.791     0.999915        28996     11702.86
    1953.791     0.999927        28996     13653.33
    2516.991     0.999939        28998     16384.00
    2516.991     1.000000        28998          inf
#[Mean    =      358.155, StdDeviation   =      316.513]
#[Max     =     2514.944, Total count    =        28998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30028 requests in 5.00m, 145.75MB read
  Non-2xx or 3xx responses: 421
Requests/sec:    100.07
Transfer/sec:    497.39KB