wrk_rps_merged/222
Running 5m test @ http://10.99.162.103:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 226.285ms, rate sampling interval: 900ms
  Thread calibration: mean lat.: 236.352ms, rate sampling interval: 1071ms
  Thread calibration: mean lat.: 254.964ms, rate sampling interval: 1110ms
  Thread calibration: mean lat.: 245.462ms, rate sampling interval: 1061ms
  Thread calibration: mean lat.: 248.408ms, rate sampling interval: 923ms
  Thread calibration: mean lat.: 257.928ms, rate sampling interval: 1084ms
  Thread calibration: mean lat.: 260.792ms, rate sampling interval: 1090ms
  Thread calibration: mean lat.: 257.409ms, rate sampling interval: 1079ms
  Thread calibration: mean lat.: 256.022ms, rate sampling interval: 1065ms
  Thread calibration: mean lat.: 271.452ms, rate sampling interval: 1249ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   269.70ms  259.43ms   1.98s    87.34%
    Req/Sec     9.60      2.54    19.00     83.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  237.44ms
 75.000%  340.73ms
 90.000%  454.91ms
 99.000%    1.45s 
 99.900%    1.96s 
 99.990%    1.98s 
 99.999%    1.98s 
100.000%    1.98s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.525     0.000000            1         1.00
      40.223     0.100000         2901         1.11
      88.447     0.200000         5805         1.25
     158.207     0.300000         8715         1.43
     174.591     0.400000        11618         1.67
     237.439     0.500000        14505         2.00
     249.599     0.550000        15967         2.22
     258.303     0.600000        17419         2.50
     268.543     0.650000        18877         2.86
     296.447     0.700000        20307         3.33
     340.735     0.750000        21773         4.00
     346.623     0.775000        22491         4.44
     353.023     0.800000        23218         5.00
     361.471     0.825000        23934         5.71
     387.583     0.850000        24660         6.67
     439.295     0.875000        25393         8.00
     445.695     0.887500        25750         8.89
     454.911     0.900000        26111        10.00
     469.759     0.912500        26474        11.43
     541.183     0.925000        26842        13.33
     580.607     0.937500        27199        16.00
     660.991     0.943750        27385        17.78
     730.111     0.950000        27562        20.00
     761.343     0.956250        27743        22.86
     850.431     0.962500        27923        26.67
     966.655     0.968750        28104        32.00
    1125.375     0.971875        28195        35.56
    1168.383     0.975000        28285        40.00
    1249.279     0.978125        28380        45.71
    1274.879     0.981250        28469        53.33
    1342.463     0.984375        28559        64.00
    1352.703     0.985938        28608        71.11
    1366.015     0.987500        28650        80.00
    1436.671     0.989062        28694        91.43
    1455.103     0.990625        28740       106.67
    1542.143     0.992188        28784       128.00
    1563.647     0.992969        28807       142.22
    1598.463     0.993750        28829       160.00
    1660.927     0.994531        28852       182.86
    1738.751     0.995313        28876       213.33
    1766.399     0.996094        28897       256.00
    1776.639     0.996484        28909       284.44
    1825.791     0.996875        28920       320.00
    1844.223     0.997266        28931       365.71
    1858.559     0.997656        28943       426.67
    1873.919     0.998047        28954       512.00
    1880.063     0.998242        28960       568.89
    1936.383     0.998437        28965       640.00
    1948.671     0.998633        28972       731.43
    1951.743     0.998828        28977       853.33
    1955.839     0.999023        28983      1024.00
    1956.863     0.999121        28985      1137.78
    1958.911     0.999219        28988      1280.00
    1961.983     0.999316        28991      1462.86
    1965.055     0.999414        28994      1706.67
    1966.079     0.999512        28996      2048.00
    1968.127     0.999561        28998      2275.56
    1971.199     0.999609        28999      2560.00
    1972.223     0.999658        29001      2925.71
    1973.247     0.999707        29002      3413.33
    1975.295     0.999756        29003      4096.00
    1976.319     0.999780        29004      4551.11
    1978.367     0.999805        29005      5120.00
    1979.391     0.999829        29007      5851.43
    1979.391     0.999854        29007      6826.67
    1979.391     0.999878        29007      8192.00
    1979.391     0.999890        29007      9102.22
    1983.487     0.999902        29008     10240.00
    1983.487     0.999915        29008     11702.86
    1983.487     0.999927        29008     13653.33
    1984.511     0.999939        29010     16384.00
    1984.511     1.000000        29010          inf
#[Mean    =      269.701, StdDeviation   =      259.425]
#[Max     =     1983.488, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30048 requests in 5.00m, 168.82MB read
Requests/sec:    100.14
Transfer/sec:    576.11KB